henrique/shellTubeHEX/shellTubeHEX/system/controlDict
FoamFile
{
	class	dictionary;
	format	ascii;
	location	system;
	object	controlDict;
	version	2.0;
}
adjustTimeStep	true;
application	chtMultiRegionFoam;
deltaT	1;
endTime	200;
maxCo	2;
maxDeltaT	1;
purgeWrite	0;
startFrom	latestTime;
startTime	0;
stopAt	endTime;
timeFormat	general;
timePrecision	6;
writeControl	adjustableRunTime;
writeInterval	1;
writePrecision	7;
runTimeModifiable	true;
compression	uncompressed;
writeFormat	binary;
libs	("libfvMotionSolvers.so" "libturbulenceModels.so" "libturbulenceModelSchemes.so");
functions
{
	writeExtraFieldsInHot
	{
		libs	("libutilityFunctionObjects.so");
		objects	(rho K);
		type	writeObjects;
		writeOption	anyWrite;
		executeInterval	1;
		enabled	true;
		log	true;
		writeControl	writeTime;
		writeInterval	1;
		region	hot;
	}
	writeExtraFieldsInCold
	{
		libs	("libutilityFunctionObjects.so");
		objects	(rho K);
		type	writeObjects;
		writeOption	anyWrite;
		executeInterval	1;
		enabled	true;
		log	true;
		writeControl	writeTime;
		writeInterval	1;
		region	cold;
	}
}
OptimisationSwitches
{
	fileHandler	uncollated;
	fileModificationSkew	0;
	maxMasterFileBufferSize	1.0E9;
	maxThreadFileBufferSize	1.0E9;
	mpiBufferSize	200000000;
}
