henrique/shellTubeHEX/shellTubeHEX/system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(-0.18183 -0.1212 -0.17475)
	(0.18683 -0.1212 -0.17475)
	(0.18683 0.1212 -0.17475)
	(-0.18183 0.1212 -0.17475)
	(-0.18183 -0.1212 0.78475)
	(0.18683 -0.1212 0.78475)
	(0.18683 0.1212 0.78475)
	(-0.18183 0.1212 0.78475)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (37 25 91) simpleGrading (1 1 1)
);
edges	();
boundary	(
	boundaries
	{
		type	patch;
		faces	(
			(2 6 5 1)
			(1 5 4 0)
			(4 5 6 7)
			(0 4 7 3)
			(3 7 6 2)
			(0 3 2 1)
		);
	}
);
