henrique/shellTubeHEX/shellTubeHEX/constant/hot/turbulenceProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/hot";
	object	turbulenceProperties;
}
simulationType	laminar;
