henrique/shellTubeHEX/shellTubeHEX/constant/hot/boundaryRadiationProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/hot";
	object	boundaryRadiationProperties;
}
exchanger
{
}
exchanger_hot_inlet
{
}
exchanger_hot_outlet
{
}
pipes
{
}
pipes_inlet_baffle
{
}
pipes_outlet_baffle
{
}
