henrique/shellTubeHEX/shellTubeHEX/0/cold/T
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/cold";
	object	T;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 0 0 1 0 0 0];
internalField	uniform 283;
boundaryField
{
	baffles
	{
		type	zeroGradient;
	}
	baffles_slave
	{
		type	zeroGradient;
	}
	exchanger
	{
		type	zeroGradient;
	}
	exchanger_cold_inlet
	{
		type	totalTemperature;
		T0	uniform 283;
		gamma	1.124;
	}
	exchanger_cold_outlet
	{
		type	zeroGradient;
	}
	pipes
	{
		type	compressible::turbulentTemperatureCoupledBaffleMixed;
		value	uniform 283;
		kappaMethod	fluidThermo;
		kappa	none;
		neighbourFieldName	T;
		Tnbr	T;
		alphaAni	Anialpha;
		thicknessLayers	(0.005);
		kappaLayers	(385.0);
	}
	pipes_inlet_baffle
	{
		type	compressible::turbulentTemperatureCoupledBaffleMixed;
		value	uniform 283;
		kappaMethod	fluidThermo;
		kappa	none;
		neighbourFieldName	T;
		Tnbr	T;
		alphaAni	Anialpha;
		thicknessLayers	(0.005);
		kappaLayers	(385.0);
	}
	pipes_outlet_baffle
	{
		type	compressible::turbulentTemperatureCoupledBaffleMixed;
		value	uniform 283;
		kappaMethod	fluidThermo;
		kappa	none;
		neighbourFieldName	T;
		Tnbr	T;
		alphaAni	Anialpha;
		thicknessLayers	(0.005);
		kappaLayers	(385.0);
	}
}
