henrique/shellTubeHEX/shellTubeHEX/system/surfaceFeatureExtractDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	surfaceFeatureExtractDict;
}
baffles.stl
{
	extractionMethod	extractFromSurface;
	includedAngle	120;
	geometricTestOnly	false;
}
